
          {"@context":"http://schema.org","@type":"Recipe","name":"Mushroom Wafu Pasta","description":"Wafu directly translates to “Japanese style.” As it relates to pasta, you can expect uniquely Japanese flavors and twists like mentaiko pasta, which is made with spicy cod roe, or the Napolitan, which is made with mushrooms, green peppers and bacon, sausage, or even hot dogs, in a tangy ketchup-based sauce. Kinoko, or mushroom, wafu pasta is a spaghetti dish made with a variety of Japanese mushrooms (and occasionally bacon) in an umami-rich soy-butter sauce emulsified with pasta water. Using bronze-cut dried pasta, with its rough surface, is optional but results in a superior final dish. Bronze-cut pasta is normally labeled as such on the package, otherwise, look for pasta with a surface that is more coarse. (Traditional Italian brands and some organic pastas are often made in this manner). This recipe calls for a full pound of pasta, but it halves easily.\n\nTo get vegetarian recipes like this one delivered to your inbox, \u003ca href=\"https://www.nytimes.com/newsletters/the-veggie\"\u003esign up for The Veggie newsletter\u003c/a\u003e.","author":{"@type":"Person","name":"Hana Asbrink"},"image":"https://static01.nyt.com/images/2021/10/27/dining/ha-mushroom-wafu-pasta/merlin_195254517_cda161c2-4e61-4675-9b0e-baac85c78816-articleLarge.jpg","totalTime":"PT25M","recipeYield":"4 to 6 servings","recipeCuisine":"","recipeCategory":"dinner, weekday, pastas, main course","keywords":"butter, mushroom, nori, pasta, soy sauce, vegetarian","aggregateRating":{"@type":"AggregateRating","ratingValue":4,"ratingCount":189},"recipeIngredient":["Kosher salt and black pepper","1 pound dried spaghetti, preferably bronze-cut","1/4 cup extra-virgin olive oil","8 tablespoons unsalted butter","4 to 6 garlic cloves, minced","1 pound shiitake mushrooms, or a combination of shiitake, shimeji and maitake, stems trimmed (if dry), separated and torn by hand","1/4 cup soy sauce","2 to 3 scallions, finely sliced, for garnish","Shredded, roasted nori (like shredded kizami nori or half of a nori sheet cut into thin matchsticks with scissors), for garnish"],"recipeInstructions":[{"@context":"http://schema.org","@type":"HowToStep","text":"Bring a large pot of well-salted water to a boil. Cook pasta until 1 minute shy of al dente, according to the package directions. Reserve 1 cup of pasta water, then drain."},{"@context":"http://schema.org","@type":"HowToStep","text":"While pasta cooks, make the sauce: In a large skillet, heat olive oil and 4 tablespoons of butter over medium. When the butter is melted and starts to foam, add garlic and mushrooms. Cook, stirring only occasionally to ensure garlic doesn't burn, until mushrooms start browning on the edges, about 6 to 7 minutes. Season with 1/2 teaspoon salt and about 12 to 15 cranks of pepper. If the pasta is still cooking, remove the skillet from the heat and set aside until pasta is ready."},{"@context":"http://schema.org","@type":"HowToStep","text":"Return the skillet to medium low. Push the mushrooms to one side of the skillet. Add remaining 4 tablespoons butter and soy sauce, allowing butter to melt into the soy sauce before combining with the mushrooms. Add pasta and 1/2 cup of the pasta water to the skillet, tossing to coat with the sauce. Cook, adding more pasta water 1 tablespoon at a time as needed, until pasta is glossy, about 1 minute."},{"@context":"http://schema.org","@type":"HowToStep","text":"Remove from heat. Top with sliced scallions and shredded nori. Serve immediately."}],"isAccessibleForFree":"False","hasPart":{"@type":"WebPageElement","isAccessibleForFree":"False","cssSelector":".recipe"},"publisher":{"@context":"http://schema.org","@type":"Organization","name":"NYT Cooking","url":"https://cooking.nytimes.com","alternateName":["nytimes cooking","New York Times Cooking"],"image":[{"url":"https://static01.nyt.com/applications/cooking/80b7044/assets/SiteLogoRed.svg","height":31,"width":168,"@context":"http://schema.org","@type":"ImageObject"},{"url":"https://static01.nyt.com/applications/cooking/80b7044/assets/SiteLogoBlack.svg","height":24,"width":131,"@context":"http://schema.org","@type":"ImageObject"}],"sameAs":["https://www.facebook.com/groups/nytcooks/","https://www.facebook.com/nytcooking/","https://www.instagram.com/nytcooking/","https://twitter.com/nytfood","https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"]}}

      